import { ref } from "vue";

const useResume = () => {
  const resumes = ref([
    {
      type: "计算机视觉工程师",
      xueli: "硕士及以上学历",
      jd: `
              <p>岗位要求：</p>
              <p>1、负责网络通信图纸识别算法研究、开发与部署</p>
              <p>2、负责图像分析分割、面部关键点识别等算法设计、实现及调试部署</p>

              <br>

              <p>任职资格：</p>
              <p>1、重点院校硕士及以上学历</p>
              <p>2、三年及以上相关领域工作经验，能力优秀的应届生也可以考虑</p>
              <p>3、有人体姿态识别、图像分割、人脸关键点识别等计算机视觉算法开发经验</p>
              <p>4、精通C/C++，Python等编程语言</p>
              <p>5、熟悉OpenCV、Halcon、Tensorflow、PyTorch</p>
              <p>6、有图像识别应用开发项目经验者优先</p>
    `,
    },
    {
      type: "CAD开发工程师",
      xueli: "本科及以上学历",
      jd: `
              <p>岗位要求：</p>
              <p>1、根据公司产品需求，负责CAD相关系统研发和维护</p>
              <p>2、架构设计、模块划分和代码编写，按照项目进度要求进行程序开发</p>
              <p>3、系统瓶颈分析、性能调优、解决实际工作中遇到的技术问题</p>
              <p>4、与各相关系统进行接口测试</p>

              <br>

              <p>任职资格：</p>
              <p>1、本科及以上学历</p>
              <p>2、三年及以上.NET开发经验，熟练掌握C#</p>
              <p>3、具备AutoCAD或国产CAD软件相关开发经验</p>
              <p>4、编程基础和空间解析几何基础知识扎实</p>
              <p>5、了解CS/BS架构，熟悉与服务端交互的基础通信协议（HTTP，TCP/IP）</p>
              <p>6、了解MQ中间件及使用场景</p>
              <p>7、熟悉MySql，Sqllite等数据库</p>
    `,
    },
  ]);

  return {
    resumes,
  };
};

export { useResume };
